# !/usr/bin/env python
# -*- coding: utf-8 -*-
# liumiao 2022/9/23 13:15
print('python基础')

"""
变量，存储数据的载体，占用内存空间
变量，可以被读取和修改
变量，大小写敏感，a和A是两个变量
变量，命名不能数字开头
"""
var_a = 1  # 声明变量
var_a = 2  # 修改变量
print(var_a)
"""数据类型"""
int_a = 1  # 整形
float_a = 1.0  # 浮点型
print(type(int_a))  # 打印数据类型
"""运算符"""
print(1 + 1 * 2 / 2)  # 加减乘除与数学一致
print(11 % 9)  # 取余
print(2 ** 3)  # 2的3次方
print((1 + 1) * 2)  # 运算优先级
print(1 == 1)  # 求等号两边数据相等
print(1 != 2)  # 求等号两边数据不相等
"""字符串-基础"""
str_a = 'abc123!@#'
str_b = '\\n'  # 转义字符
str_c = r'\n'  # 转义字符
print(str_a + str_b + str_c)  # 字符连接
"""字符串-索引"""
print(str_a[0])  # 打印字符第一位，索引对应=0，以此类推
"""字符串-切片"""
print(str_a[1:])  # 打印字符从第二位开始，切片=1:
print(str_a[1:5])  # 打印字符第二至四位，切片=1:5，前闭后开原则1≤x＜5
print(str_a[1:5:2])  # 打印字符第二至四位，且每2步取字符，切片：1:5:2（start:stop:step）
"""列表"""
list_a = [1, 2, 3, 'a', 'b', 'c', True]  # 中括号包起来的叫列表
print(list_a[-1])  # 与字符串索引&切片一致，打印字符最后一位，索引=-1
print(list_a[::-1])  # 打印字符倒序输出
